app/controllers/holidayrequests_controller.rb

  def index
    login_required
    @holidayrequests = Holidayrequests.all
---
SELECT * FROM "holidayrequests"

  def show
    login_required
    @holidayrequests = Holidayrequests.find(params[:id])
---
SELECT * FROM "holidayrequests" WHERE ("holidayrequests"."id" = 1)

  def edit
    login_required
    @holidayrequests = Holidayrequests.find(params[:id])
---
SELECT * FROM "holidayrequests" WHERE ("holidayrequests"."id" = 1)

  def create
    login_required
    @holidayrequests = Holidayrequests.create(params[:holidayrequests])
    @holidayrequests.user_id = current_user.id
    if @holidayrequests.save
---
INSERT INTO "holidayrequests" ("dateto", "created_at", "updated_at", "fullname", "datefrom", "approved", "userid", "user_id", "noofdays") VALUES('2012-09-25', '2012-01-26 14:57:45', '2012-01-26 14:57:45', 'Lewis Strong', '2012-09-20', NULL, 'enrlstro', NULL, NULL)
UPDATE "holidayrequests" SET "updated_at" = '2012-01-24 14:52:23', "user_id" = 1 WHERE "id" = 26

  def update
    login_required
    @holidayrequests = Holidayrequests.find(params[:id])
    @holidayrequests.update_attributes(params[:holidayrequests])
---
SELECT * FROM "holidayrequests" WHERE ("holidayrequests"."id" = 4)
UPDATE "holidayrequests" SET "updated_at" = '2012-01-18 12:21:23', "userid" = 'enrtestm', "fullname" = 'Mr Test Woman' WHERE "id" = 4

  def destroy
    login_required
    @holidayrequests = Holidayrequests.find(params[:id])
    @holidayrequests.destroy
---
SELECT * FROM "holidayrequests" WHERE ("holidayrequests"."id" = 6)
DELETE FROM "holidayrequests" WHERE "id" = 6