app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "admin", "password_salt", "password_hash", "email") VALUES('2012-01-26 14:57:21', '2012-01-26 14:57:21', 'enrlstro', NULL, '9397c9b316cf5031221289c16459d359840ed214', 'ee7ecdb4eea73ac08895b185c2360d89ce3f379e', 'l.strong@2009.ljmu.ac.uk')
---
  def create
    @user = User.new(params[:user])
    if @user.save